1. Что неправильно в следующей программе:

	int main(void)
	{
		int * fp;
		int k;
		fp = fopen("gelatin");
		for (k = 0 ; k < 30; k++)
			fputs(fp, "Кто-то ест студень.");
		fclose("gelatin");
		return 0;
	}

2. Что делает следующая программа? (Предположите, что она запускается в среде командной строки.)

	#include <stdio.h>
	#include <stdlib.h>
	#include <ctype.h>
	int main(int argc, char *argv[])
	{
		int ch;
		FILE *fp;
		
		if (argc < 2)
			exit(EXIT_FAILURE);
		if ( (fp = fopen(argv[1], "r")) == NULL)
			exit(EXIT_FAILURE);
		while ( (ch= getc(fp)) != EOF )
			if( isdigit(ch) )
				putchar(ch);
		fclose (fp);
		return 0;
	}

3. Предположим, что в программе имеются следующие операторы:

	#include <stdio.h>
	FILE * fp1,* fp2;
	char ch;
	fp1 = fopen("terky", "r");
	fp2 = fopen("jerky", "w");

Кроме того, предположим, что оба файла были успешно открыты. Добавьте не достающие аргументы в следующие вызовы функций:

	а. ch = getc();
	б. fprintf( ,"%c\n", );
	в. putc ( , );
	г. fcloset();	/* закрыть файл terky */

4. Напишите программу, которая принимает ноль или один аргумент командной строки. Если имеется один аргумент, он интерпретируется как имя файла. Если аргумент не указан, то должен использоваться стандартный ввод (stdin). Предположите, что ввод состоит целиком из чисел с плавающей запятой. Программа должна вычислять и отображать среднее арифметическое значение для введенных чисел.

5. Напишите программу, которая принимает два аргумента командной строки. Первым аргументом является символ, а вторым — имя файла. Программа должна выводить из файла только те строки, которые содержат указанный символ.

На заметку!

Строки файла идентифицируются символом новой строки '\n'. Предположим, что ни одна из строк по длине не превышает 256 символов. Возможно, потребуется использовать функцию fgets().

6. В чем разница между двоичными и текстовыми файлами с одной стороны и двоичными и текстовыми потоками —с другой?

7. 	а. В чем разница между сохранением числа 8238201 с помощью fprintf() и его сохранением посредством fwrite()?
	б. В чем разница между сохранением символа S с помощью putc() и его сохранением посредством fwrite()?

8. Чем отличаются друг от друга следующие операторы?

	printf("Здравствуйте, %s\n", name);
	fprintf(stdout, "Здравствуйте, 1s\n", name);
	fprintf(stderr, "Здравствуйте, %s\n", name);

9. Режимы "а+", "r+" и "w+" открывают файл для чтения и записи. Какой из них лучше всего подходит для изменения содержимого, находящегося в файле?


