/* 1. Экспериментальным путем выясните, как ваша система обрабатывает переполнение при выполнении операций над целыми числами и над числами с плавающей запятой, а также потерю значимости при выполнении операций над числами с плавающей запятой; т.е. напишите программу, в которой присутствуют такие проблемы. (Для получения сведений о наибольших и наименьших значениях просмотрите обсуждение limits .h и float .h в главе 4.) */

/* 2. Нанишите программу, которая приглашает ввести некоторое значение в коде ДОСИ, например, 66, а затем выводит символ, которому соответствует введенный код. */

/* 3. Напишите программу, которая выдает префедительный звуковой сигнал, а затем выводит следующий текст:

Напуганная внезапным звуком, Вика вскрикнула:
"Во имя всех звезд, что это было!" */

/* 4. Напишите программу, которая считывает число с главающей запятой и выводит его сначала в десятичном представлении, потом в экспоненциальном представлении и затем в двоично-экспоненциальном представлении, если система его поддерживает. Вывод должен быть представлен в следующем формате (фактическое количество отображаемых цифр показателя степени зависит от системы):

Введите значение с плавающей запятой: 64.25
Запись с фиксированной запятой: 64.250000
Экспоненциальная форма записи: 6.425000e+Ol
двоично-экспоненциальное представление: Oxl.Olp+6 */

/* 5. В году содержится примерно 3.156х107 секунд. Напишите программу, которая предлагает ввести возраст в годах, а затем выводит на экран эквивалентное значение в секундах. */

/* 6. Масса одной молекулы воды приблизительно составляет 3.Ох 10_2Я грамм. Кварта воды весит примерно 950 грамм. Напишите программу, которая предлагает ввести значение объема воды в квартах и отображает количество молекул воды в этом объеме. */

/* 7. В дюйме имеется 2.54 сантиметра. Напишите программу, которая предлагает ввести рост в дюймах, после чего выводит на экран этот рост в сантиметрах. Либо, если вам так больше нравится, программа может запрашивать рост в сантиметрах и переводить его в дюймы. */

/* 8. В американской системе единиц измерений объема пинта равна 2 чашкам, чашка —8 унциям, унция —2 столовым ложкам, а столовая ложка —3 чайным ложкам. Напишите программу, которая предлагает ввести объем в чашках и отобр^ает эквивалентные значения в пинтах, унциях, столовых ложках и чайных ложках. Почему для этой программы тип с плавающей запятой подходит больше, чем целочисленный? */

